class txt:
    hello = "Добро пожаловать в школьный бот! Он еще разрабатывается, если что :3"
    helpsend = "Вы хотите получать рассылку изменений в расписании?"
    agree = 'Теперь вы будете получать новое расписание!'
    disagree = 'Вы не будете получать расписание ('
    nonew = 'Мы вернули вас на главную страницу.'
    access = 'Успешно!'
    rospis = 'НОВОЕ РАСПИСАНИЕ НА СЕГОДНЯ!'
    update = 'Произошло обновление бота )'
    info = '- Зайдите в меню.'
    doctext = 'Выберите кому хотите отправить уведомление!'
    nowsend = 'Введите текст, который вы хотите отправить!'
    messend = '📳 УВЕДОМЛЕНИЕ 📳 \n\n{0}'
    newteach = 'Вы зашли под: "{0}"'
    menu = 'Добро пожаловать в меню! Тут вы можете авторизоваться в свой профиль или подписаться на расслку расписаний!'

class adm:
    infoadm = '/update - обновить у всех нижнюю панель'
    addteach = 'Учитель'
    addadm = 'Администратор'
    addteachclass = 'Кл. Руководитель'
    addschool = 'Класс'
    addsmam = 'Родитель'
    infoinvite = 'Выберите роль, которую хотите выдать'
    invited = 'Введите номер телефона пользователя'
    error = 'Пользователь не найден'
    success = 'Пользователь добавлен в "{0}"\nЕго номер телефона: {1}'
    successes = 'Пользователь добавлен в класс "{0}"\nЕго номер телефона: {1}'
    successesdel = 'Вы успешно обнулили пользователя {0}'
    goclass = 'Введите номер телефона ученика.'
    goclassmam = 'Введите номер телефона родителя.'
    classes = 'Введите класс'
    delete = 'Удалить'
    deletetxt = 'Введите номер телефона, кого хотите обнулить'


class invite:
    yes = 'Принять'
    no = 'Отменить'
    text = 'Вас пригласили в {0} класс'
    error = 'Вы отменили приглашение в {0} класс'
    success = 'Вы приняли приглашение в {0} класс'

class menu:
    menu = 'Меню'
    rass = 'Рассылка'
    login = 'Авторизация'
    classadd = 'Приглашение'

class login:
    sendwhat = 'Авторизация - это подтверждения свой личности. Нажмите на "Отправить данные"'
    success = 'Вы успешно подтвердили себя! Ваш номер телефона заканчивается на: {0}'

class button:
    chooseall = 'Все'
    choosetech = 'Учителя'
    choosetech_send = 'Учителям'
    help = "Помощь"
    senddoc = '🅰Уведомление🅰'
    yes = '✅ ДА ✅'
    no = '❌ НЕТ ❌'
    sendnew = 'Уведомление'
    cancel = 'Отмена'
    invite = 'Пригласить'

class uved:

    rasp = 'Расписание'
    child = 'Детям'
    gonew = "Кому желаете отправить уведомление?"
    uvdeomchild = 'Всем (пдт)'
    sendmestoclass = 'Введите в какие классы вы хотите отправить уведомление.\n\nНапример: 9A\nНапример: 8 - просто цифра(все 5-ые классы)'
    sendmlass = 'Введите сообщение/фото/видео для отправки в {0} класс.'
    uvdeomall = 'Всем'
    childto = 'Классу'
    mamto = 'Родителям'
    sendmesto = 'Введите текст, который хотите отправить(фотографию)'
    sendmestoclass_now = 'Введит текст, который хотите отправить своему классу'